In [255]:
import pandas as pd

# Indexed Series

In [256]:
# Creating a Indexed Pandas Series without using a dictionary
series_data = pd.Series([1, 4, 9, 6, 7], index=['a', 'x', 'c', 2, 'e'])

# Another method to create an Indexed Pandas Series without the use of a dictionary
d_s = [1, 4, 9, 6, 7]
data_series = pd.Series(d_s, index = ['a', 'x', 'c', '2', 'e'])

# Displaying the Pandas Series
print(series_data)
print(data_series)

a    1
x    4
c    9
2    6
e    7
dtype: int64
a    1
x    4
c    9
2    6
e    7
dtype: int64

# Pandas Dictionary

In [257]:
# Creating a Pandas Series using a dictionary
data = {'Bilal': 42, 'Ayesha': 38, 'Hadia': 39}
series_data = pd.Series(data)

# Displaying the Pandas Series
print(series_data)

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

# Python Dictionary

In [258]:
# Creating a Pandas DataFrame using a dictionary
weather = {
    'day': ['01/01/17', '01/02/17', '01/03/17', '01/04/17', '01/05/17', '01/06/17'],
    'temperature': [32, 35, 28, 24, 32, 31],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}

df_weather = pd.DataFrame(weather)

# Displaying the Pandas DataFrame
df_weather

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           31          2  Sunny

# Altering The Index

In [259]:
df_weather = pd.DataFrame(weather, index=['a', 'b', 'c', 'd', 'e', 'f'])
df_weather

        day  temperature  windspeed  event
a  01/01/17           32          6   Rain
b  01/02/17           35          7  Sunny
c  01/03/17           28          2   Snow
d  01/04/17           24          7   Snow
e  01/05/17           32          4   Rain
f  01/06/17           31          2  Sunny

# Additional Statistics

In [260]:
# Calculating mean, maximum, and minimum for the 'temperature' column
mean_temp = df_weather['temperature'].mean()
max_temp = df_weather['temperature'].max()
min_temp = df_weather['temperature'].min()

# Displaying the results
print("\nStatistics for 'temperature' column:")
print(f"Mean Temperature: {mean_temp}")
print(f"Maximum Temperature: {max_temp}")
print(f"Minimum Temperature: {min_temp}")

# The statistics can be more directly accessed as such
print('\n')
print("The Mean Temperature: ", df_weather['temperature'].mean())
print("The Maximum Temperature: ", df_weather['temperature'].max())
print("The Minimum Temperature: ", df_weather['temperature'].max())

Statistics for 'temperature' column:
Mean Temperature: 30.333333333333332
Maximum Temperature: 35
Minimum Temperature: 24


The Mean Temperature:  30.333333333333332
The Maximum Temperature:  35
The Minimum Temperature:  35

# Employees DB Import/Export

In [261]:
# Read CSV file, extract specified columns, and skip specified rows
# people.csv is saved in same folder as jupyter
df = pd.read_csv('people.csv', usecols=["First Name", "Sex", "Email", "Phone", "Job Title"], skiprows=[1, 5])

# Set 'Sex' and 'Job Title' as index columns
df.set_index(["Sex", "Job Title"], inplace=True)

# Export the modified DataFrame to a new CSV file
df.to_csv('NewPeople.csv')

# Display the DataFrame
df

                                First Name                       Email  \
Sex    Job Title
Female Phytotherapist              Phillip       bethany14@example.com
Male   Homeopath                  Kristine       bthompson@example.com
       Market researcher           Yesenia   kaitlinkaiser@example.com
       Waste management officer       Erin         tconner@example.org
Female Intelligence analyst      Katherine     conniecowan@example.com
...                                    ...                         ...
       Software engineer            Dennis         bmartin@example.org
       Barrister                     Steve       latasha46@example.net
Male   Police officer               Wesley        regina11@example.org
Female Broadcast journalist         Summer  alexiscantrell@example.org
Male   IT sales professional        Mariah       pcopeland@example.org

                                                 Phone
Sex    Job Title
Female Phytotherapist                214.112.6044x4913
Male   Homeopath                          277.609.7938
       Market researcher                  584.094.6111
       Waste management officer  001-171-649-9856x5553
Female Intelligence analyst      +1-773-151-6685x49162
...                                                ...
       Software engineer          001-095-524-2112x257
       Barrister                      001-865-478-5157
Male   Police officer               995-542-3004x76800
Female Broadcast journalist       001-273-685-6932x092
Male   IT sales professional       (341)594-6554x44657

[98 rows x 3 columns]

# Importing & Modifying .xlsx

In [276]:
# Read Excel file, select specified columns, skip specified rows, and set row 2 as header
# SampleWork.xlsx is saved in same folder as jupyter

# *df_sample = pd.read_excel('SampleWork.xlsx', sheet_name=0, usecols=[0, -1], skiprows=[1], header=1)
# *does not select correct columns because usecols requires column names, not index numbers

df_sample = pd.read_excel('SampleWork.xlsx', sheet_name=0, skiprows=[1], header=1).iloc[:, [0, -1]]


# Export the modified DataFrame to a new Excel sheet
df_sample.to_excel('NewSheet.xlsx', index=False)

# Display the DataFrame
df_sample

    Bilal  90
0  Sufyan  85
1   Saiqa  80
2   Aimen  75

# AI Community Pk DataFrame

In [263]:
# Create DataFrame AICP_DF
data = {'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
        'Age': [27, 24, 22, 32, 23],
        'Address': ['Lahore', 'Karachi', 'Sialkot', 'Peshawar', 'Lahore'],
        'Qualification': ['Msc', 'MA', 'MCA', 'Phd', 'Bsc']}
AICP_DF = pd.DataFrame(data)

print("AICP_DF:")
AICP_DF

AICP_DF:

    Name  Age   Address Qualification
0  Sonia   27    Lahore           Msc
1  Bilal   24   Karachi            MA
2  Hifza   22   Sialkot           MCA
3  Kabir   32  Peshawar           Phd
4  Jazim   23    Lahore           Bsc

In [264]:
# 1) Select 'Name' and 'Qualification' columns and save to df1
df1 = AICP_DF[['Name', 'Qualification']]

print("\n\ndf1:")
df1

df1:

    Name Qualification
0  Sonia           Msc
1  Bilal            MA
2  Hifza           MCA
3  Kabir           Phd
4  Jazim           Bsc

In [265]:
# 2) Add a new column "Height" with the given values
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]

print("AICP_DF:")
AICP_DF

AICP_DF:

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           Msc     5.1
1  Bilal   24   Karachi            MA     6.2
2  Hifza   22   Sialkot           MCA     5.1
3  Kabir   32  Peshawar           Phd     5.2
4  Jazim   23    Lahore           Bsc     5.1

In [266]:
# 3) Set column "Name" as the index column
AICP_DF.set_index('Name', inplace=True)

print("AICP_DF:")
AICP_DF

AICP_DF:

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           Msc     5.1
Bilal   24   Karachi            MA     6.2
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23    Lahore           Bsc     5.1

In [267]:
# 4) Retrieve row with index "Hifza"
AICP_DF.loc['Hifza']

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [268]:
# 4) Retrieve row with index "Hifza" - using an additional variable
row_hifza = AICP_DF.loc['Hifza']

print("\n\nRow with index 'Hifza':")
row_hifza

Row with index 'Hifza':

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [269]:
# 5) Retrieve row with index 3
AICP_DF.iloc[3]

Age                    32
Address          Peshawar
Qualification         Phd
Height                5.2
Name: Kabir, dtype: object

In [270]:
# 5) Retrieve row with index 3 - using an additional variable
row_index_3 = AICP_DF.iloc[3]

print("\n\nRow with index 3:")
row_index_3

Row with index 3:

Age                    32
Address          Peshawar
Qualification         Phd
Height                5.2
Name: Kabir, dtype: object

In [271]:
# 6) Drop row with index "Bilal"
AICP_DF.drop('Bilal', inplace=True)

# Display the DataFrame
print("\n\nAICP_DF; (without Bilal): ")
AICP_DF

AICP_DF; (without Bilal):

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           Msc     5.1
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23    Lahore           Bsc     5.1